Repository: hTuneSys/hexaGenApp
Catalog: hexagenapp/lib/l10n/app_*.arb
Languages: tr

source: Profile
tr: Profil

source: Notifications
tr: Bildirimler

source: Generate Signal
tr: Sinyal Oluştur

source: How to use
tr: Nasıl Kullanılır

source: History
tr: Geçmiş

source: Our Products
tr: Ürünlerimiz

source: Settings
tr: Ayarlar

source: Frequency Generation
tr: Frekans Üretimi

source: Manual Frequency
tr: Manuel Frekans

# selectedFrequency
source: Selected frequency: {value}
tr: Seçili frekans: {value}

# secondsLabel
source: Duration (s)
tr: Süre (sn)

# secondsHint
source: e.g. 0.5
tr: Örn: 0.5

# secondsPositiveError
source: Duration (s) must be a positive number
tr: Süre (sn) pozitif bir sayı olmalı

source: Add
tr: Ekle

# listTitle
source: List (Frequency + Duration)
tr: Liste (Frekans + Süre)

# noItems
source: No items yet. Add from above.
tr: Henüz öğe yok. Yukarıdan ekleyin.

source: Delete
tr: Sil

# secondsShort
source: {seconds} s
tr: {seconds} sn

source: Repeat
tr: Tekrar

source: Decrease
tr: Azalt

source: Increase
tr: Arttır

source: Clear All
tr: Temizle

# maxItemsReached
source: Maximum 64 items allowed
tr: Maksimum 64 öğe eklenebilir

# totalItems
source: Total items: {count}
tr: Toplam öğe: {count}

source: Repeat: {count}
tr: Tekrar: {count}

# invalidCommand
source: Not an AT command
tr: AT komutu değil

source: DDS busy
tr: DDS meşgul

# invalidUtf8
source: Invalid UTF-8 in param
tr: Parametrede geçersiz UTF-8

source: Invalid SysEx
tr: Geçersiz SysEx

source: Invalid data length
tr: Geçersiz veri uzunluğu

source: Param count
tr: Parametre sayısı hatası

source: Param value
tr: Parametre değeri hatası

source: Not a query
tr: Sorgu değil

source: Unknown command
tr: Bilinmeyen komut

# deviceNoDeviceConnected
source: No Device Connected
tr: Cihaz Bağlı Değil

# devicePleaseConnect
source: Please connect a hexaTune device
tr: Lütfen bir hexaTune cihazı bağlayın

# deviceQueryingVersion
source: Querying version...
tr: Versiyon sorgulanıyor...

# deviceVersion
source: Version: {version}
tr: Versiyon: {version}

# deviceError
source: Error: {message} ({code})
tr: Hata: {message} ({code})

source: Coming Soon
tr: Yakında Hizmette

# comingSoonMessage
source: This feature will be available soon. Stay tuned!
tr: Bu özellik yakında kullanıma sunulacak. Takipte kalın!

source: Theme Mode
tr: Tema Modu

# themeSystem
source: System
tr: Sistem

# themeLight
source: Light
tr: Açık

# themeDark
source: Dark
tr: Koyu

# operationCompletedSuccessfully
source: Generation completed successfully
tr: Üretim başarıyla tamamlandı

source: Operation stopped by user
tr: İşlem kullanıcı tarafından durduruldu

source: Operation failed with errors
tr: İşlem hatalarla başarısız oldu

source: Operation stopped
tr: İşlem durduruldu

source: Operation completed and saved
tr: İşlem tamamlandı ve kaydedildi

# operationFailedCheckDevice
source: Operation failed. Please check the device.
tr: İşlem başarısız oldu. Lütfen cihazı kontrol edin.

# commandTimeout
source: Command timeout: {command}
tr: Komut zaman aşımı: {command}

# deviceConnected
source: Device connected: {name}
tr: Cihaz bağlandı: {name}

# deviceStatusChanged
source: Device status changed to {status}
tr: Cihaz durumu değişti: {status}

# commandFailed
source: Command failed: {code}
tr: Komut başarısız: {code}

# deviceVersionReceived
source: Device version: {version}
tr: Cihaz sürümü: {version}

# notificationsTitle
source: Notifications
tr: Bildirimler

source: No notifications
tr: Bildirim yok

source: Reset command sent
tr: Reset komutu gönderildi

source: Debug
tr: Hata Ayıklama

source: Auto Scroll
tr: Otomatik Kaydırma

source: Clear
tr: Temizle

# filterAll
source: All
tr: Tümü

# filterInfo
source: Info+
tr: Bilgi+

# filterWarning
source: Warn+
tr: Uyarı+

# filterError
source: Error+
tr: Hata+

source: No logs yet
tr: Henüz log yok

# historyTitle
source: Operation History
tr: İşlem Geçmişi

# noOperationsYet
source: No operations saved yet
tr: Henüz kayıtlı işlem yok

source: Operation Date
tr: İşlem Tarihi

source: Total Items: {count}
tr: Toplam Öğe: {count}

# totalDuration
source: Total Duration: {duration}
tr: Toplam Süre: {duration}

source: Regenerate
tr: Yeniden Üret

source: Frequency
tr: Frekans

source: Duration
tr: Süre

# operationRegenerated
source: Operation loaded to generation page
tr: İşlem üretim sayfasına yüklendi
